my_mounth = input("введите месяц: ")
my_year = [
    ["январь", "Зима"],
    ["февраль", "Зима"],
    ["март", "Весна"],
    ["апрель", "Весна"],
    ["май", "Весна"],
    ["июнь", "Лето"],
    ["июль", "Лето"],
    ["август", "Лето"],
    ["сентябрь", "Осень"],
    ["октябрь", "Осень"],
    ["ноябрь", "Осень"],
    ["декабрь", "Осень"]
]
my_dict = {"январь": "Зима", "февраль": "Зима", "март": "Весна", "апрель": "Весна", "май": "Весна", "июнь": "Лето",
           "июль": "Лето", "август": "Лето", "сентябрь": "Осень", "октябрь": "Осень", "ноябрь": "Осень",
           "декабрь": "Осень"}
if my_mounth.isdigit() == True:
    if 0 < int(my_mounth) <= 12:
        m = int(my_mounth) - 1
        print(f"месяц {my_year[m][0]}, время года {my_year[m][1]}")
    else:
        print("Error")
else:
    try:
        print(f"месяц {my_mounth}, время года {my_dict[my_mounth.lower()]}")
    except KeyError:
        print("Ошибка! Не могу определить месяц")
